{
  "bingo_tips": {
    "Warrior": {
      "difficulty": "Easy",
      "note": [
        "This will simply happen while doing other goals."
      ]
    },
    "Oak Wood Collector": {
      "difficulty": "Hard",
      "note": [
        "Place Oak Minions and upgrade them to t4/5.",
        "Make sure to give them at least medium storages.",
        "Remember to use fuel in your minions,",
        "Enchanted Charcoal is the cheapest option here."
      ]
    },
    "Reinforced Reforger": {
      "difficulty": "Easy",
      "note": [
        "Mine Diamonds in the Deep Caverns until you get a Rare Diamond to apply.",
        "Safe spot to do this is between the Diamond Reserve and ",
        "the Obsidian Sanctuary (-20 27 70).",
        "Mobs don't spawn there."
      ]
    },
    "Minion Machine": {
      "difficulty": "Medium",
      "note": [
        "Doing this will unlock your 11th Minion Slot."
      ]
    },
    "Redstone Collector": {
      "difficulty": "Medium",
      "note": [
        "Place 10 t5 Redstone minions with compactors and fuel.",
        "Enchanted Charcoal is the cheapest option here.",
        "Manually mine in the Crystal Hollows or Dwarven Mines,",
        "if you want this to go faster."
      ]
    },
    "Fashionable": {
      "difficulty": "Easy",
      "note": [
        "Leather, Iron, Gold, Diamond (self-explanatory),",
        "Chainmail (buy from the Iron Forger in the Gold Mine for 275 coins),",
        "Leaflet (craft with 24 Oak Leaves after getting Oak Wood Collection III),",
        "Farm Suit (craft with 24 Hay Bales after unlocking Wheat Collection III),",
        "Mushroom (craft with 24 Red Mushrooms after unlocking Mushroom Collection III),",
        "Cactus (craft with 24 Cactus after unlocking Cactus Collection II),",
        "The following sets can be bought from Rosetta in the Hub (-12 68 -141):",
        "Squire (costs 24.000 coins),",
        "Rosetta’s (costs 4.530 coins),",
        "Celeste (costs 24.000 coins)"
      ]
    },
    "Rock Solid": {
      "difficulty": "Easy",
      "note": [
        "Mine 7.500 ores to get the uncommon Rock Pet.",
        "Cobblestone counts for this.",
        "Maybe combine this with Redstone Collector, in case you want to manual that one."
      ]
    },
    "Strongman": {
      "difficulty": "Medium",
      "note": [
        "Hold a Raider Axe, get a splash, equip a Bingo Pet",
        "and get the cake buff by eating the cakes on owocato's or prtl's island.",
        "In case you don't get it early on, do this after you gained some wood collection."
      ]
    },
    "Exterminator": {
      "difficulty": "Hard",
      "note": [
        "Use a dreadlord sword, a Dragon Shortbow, Artisanal Shortbow or any melee weapon",
        "and kill spiders, goblins, hub zombies or even mobs spawned by minions."
      ]
    },
    "Slayer": {
      "difficulty": "Easy",
      "note": [
        "You will have to do one t1",
        "and 8 t2 slayer bosses.",
        "Zombie Slayer is probably the easiest."
      ]
    },
    "Clownfish Collector": {
      "difficulty": "Easy",
      "note": [
        "Place 5 t4 Fishing Minions (Remember to buy your daily 640 raw fish.)",
        "Remember to give them medium storages and fuel.",
        "Enchanted Charcoal is the cheapest option here."
      ]
    },
    "Strange Effects": {
      "difficulty": "Easy",
      "note": [
        "Look for mobs with a purple name."
      ]
    },
    "Powder Collector": {
      "difficulty": "Medium",
      "note": [
        "Open chests in the Crystal Hollows,",
        "mine Mithril there or in the Dwarven Mines.",
        "Remember to claim your daily powder from the Puzzler (181 196 135)",
        "while a 2x powder event is active.",
        "He refreshes his offer 24h after the last claim."
      ]
    },
    "An Axe To Grind": {
      "difficulty": "Medium",
      "note": [
        "Buy a Raider Axe with coins (130.000) from Relics in the Spiders Den",
        "or from skill level ups from the Viking Shop (-360 91 76) in the Park.",
        "Enchant it using the xp from mining or xp bottles from ender nodes.",
        "Remember: t1 enchants as Smite I count for this."
      ]
    },
    "Taking Flight": {
      "difficulty": "Easy",
      "note": [
        "Kill Mooshroom Cows in the Mushroom Desert or harvest mushrooms there",
        "until you unlock the recipe (Mushroom Collection IV).",
        "Don't fall in the void after you drank it ;-)"
      ]
    },
    "Sea Summoner": {
      "difficulty": "Easy",
      "note": [
        "Claim your cake buff (visit owocato or prtl for it)",
        "hold an angler 4 or 5 rod and visit someone with a Sea Creature Chance beacon",
        "(visit IQONIQ_ , valkeea or HunterHiHunter)."
      ]
    },
    "Commission Master": {
      "difficulty": "Easy",
      "note": [
        "Remember to take advantage of the daily HOTM xp bonus",
        "for the first 4 commissions per day.",
        "Do those daily commissions for one more day to unlock the Crystal Hollows."
      ]
    },
    "Amethyst Crystal": {
      "difficulty": "Medium",
      "note": [
        "Find a Key Guardian and loot share it for a Jungle Key in the Crystal Hollows.",
        "You can share and find Key Guardian coordinates",
        "in the 'Bingo Brewers' and 'Bingo Splash Community' Discord.",
        "Then use wishing compasses to find the Jungle Temple in the Crystal Hollows",
        "and complete the parkour inside."
      ]
    },
    "Fairy Finder": {
      "difficulty": "Easy",
      "note": [
        "Collect those you run along while doing other goals. If you have trouble",
        "check TimeDeo's fairy soul tutorial on YouTube."
      ]
    },
    "Pet Hoarder": {
      "difficulty": "Medium",
      "note": [
        "Options are:",
        "Bingo, Rock, Grandma Wolf, Bee, Enderman, Armadillo, Griffin,",
        "Reindeer, Tarantula and pets sold by Oringo (all those don't require eggs).",
        "Craftable pets are:",
        "Jerry, Rabbit, Pig, Endermite, Silverfish.",
        "Remember: Different rarities of pets do not count for this!"
      ]
    }
  }
}