{
  "bingo_tips": {
    "Dilmun Trader (Community Goal)": {
      "difficulty": "Medium",
      "note": [
        "Copper from Visitors"
      ],
      "guide": [
        "You will gain passive progress in this",
        "by doing the At your service goal.",
        "Higher Rarity Visitors grant more Copper",
        "but are also harder to complete."
      ]
    },
    "Deep Sea Angler (Community Goal)": {
      "difficulty": "Medium",
      "note": [
        "Fish up Rare+ Sea Creatures"
      ],
      "guide": [
        "You'll want to use any kind of bait",
        "that boosts chances for rarer Sea Creatures",
        "such as Dark/Light Bait and others. Some of",
        "them have conditions for the boost to work.",
        "Probably the best idea to do this once you have",
        "Bayou Bobbin' done. Use the best rod you",
        "have access to."
      ]
    },
    "Skilled (Community Goal)": {
      "difficulty": "Easy",
      "note": [
        "Gain Combat XP"
      ],
      "guide": [
        "You will gain passive progress in the while doing",
        "various other goals. Recommended for this are",
        "Endermen. Don't forget to unlock Combat Wisdom",
        "perks in the related Essence Shop."
      ]
    },
    "Commissioned (Community Goal)": {
      "difficulty": "Easy",
      "note": [
        "Complete Mining Commissions"
      ],
      "guide": [
        "You can do Dwarven Mines/Crystal Hollows/Glacite Tunnel",
        "Commissions for that, while some may be harder than others.",
        "Make sure to not miss Active Event related goals",
        "in the Dwarven Mines, as those are rather quick and will",
        "also help towards the Dwarven Cereals."
      ]
    },
    "Scavenger (Community Goal)": {
      "difficulty": "Easy",
      "note": [
        "Gain coins from the Scavenger Enchant"
      ],
      "guide": [
        "Apply/Use the highest tier of Scavenger",
        "that you can get your hands on and put it",
        "on your main weapon. Gifts from the Jerry Island",
        "can be a way to obtain Scavenger IV books.",
        "You can also use the weapon drops from dungeon mobs",
        "as those have guaranteed Scavenger 5." 
      ]
    },
    "Yummers": {
      "difficulty": "Easy",
      "note": [
        "15 Cans of Worms"
      ],
      "guide": [
        "Those have a 20% drop chance from Trash Gobblers",
        "in the Backwater Bayou (11.3% base catch chance)",
        "and require Fishing Level 5+ to fish up.",
        "Use the best Fishing Gear you have access to."
      ]
    },
    "Exterminator": {
      "difficulty": "Medium",
      "note": [
        "Vacuum 100 Pests"
      ],
      "guide": [
        "Pest spawns have a cooldown of 5 minutes while online",
        "and an hour while offline. While actively farming, there's",
        "a 0.2% chance of a pest spawn each broken mature crop.",
        "Bonus Pest Chance can increase the amount of spawned pests",
        "at once while actively farming. You can also use up to 3",
        "Pest Traps (purchased from Philip in the Garden) to get Pests",
        "while doing other goals. Pests unlock from Garden Level 5.",
        "Use the Vacuum Philip hands you when talking to him."
      ]
    },
    "Spider Squisher": {
      "difficulty": "Medium",
      "note": [
        "75 Spiders in 90s"
      ],
      "guide": [
        "Use a Super Cleaver from Ophelia in the Dungeon Hub",
        "(80k coins + Cleaver to buy)",
        "or a Dreadlord Sword from Dungeons to achieve this.",
        "Make sure to apply Cleave 5 on your Cleaver.",
        "§cSpiders on your Private Island don't count!"
      ]
    },
    "The Mirror Dimension": {
      "difficulty": "Hard",
      "note": [
        "1,000s Rift Time"
      ],
      "guide": [
        "Theres a couple different ways to achieve this.",
        "You'll start with a base of 480s Rift Time and things like:",
        "  Wyld Armor (60s), Crux Talisman (10s), Rift Necklace (60s),",
        "  Montezuma Pet (15s), Enigma Cloak (100-200s, depending on",
        "  how many souls you get), Rift Time Century Cake (10s,",
        "  /visit skyerzz to get this), Scarf's Studies (10s)",
        "can increase that time."
      ]
    },
    "End All, Be All": {
      "difficulty": "Medium",
      "note": [
        "Kill a Zealot Bruiser"
      ],
      "guide": [
        "You only need to get the final hit on it",
        "for this to count, so ideally you team up",
        "with other Bingo Players or get your friends",
        "to lower it. You need Combat 20 to enter the",
        "portal under the entrance plattform in the",
        "Dragon Area in the End. If you want to kill one",
        "entirely by yourself, get 6+/8 pieces of the Ender Gear,",
        "a Void Sword with Ender Slayer 5+ and an elevated spot."
      ]
    },
    "Old School": {
      "difficulty": "Hard",
      "note": [
        "Craft a Runaan's Bow"
      ],
      "guide": [
        "This unlocks at 50k Bone Collection.",
        "Kill Skeletons in The Deep Caverns",
        "to unlock Skeleton Minions. Craft as many",
        "as you can and place them on your island.",
        "Give them the best fuel and storage",
        "that you have access to and collect in time.",
        "Don't forget to buy your daily bones from",
        "The Adventurer in The Hub.",
        "You'll need 192 Enchanted Bones and Enchanted String",
        "to craft this, so you'll want to also run Spider Minions."
      ]
    },
    "Pair Up!": {
      "difficulty": "Easy",
      "note": [
        "20 pairs in the experimentation table"
      ],
      "guide": [
        "Do your daily Experimentation Tables after getting",
        "Enchanting Level 10 and don't forget to make use",
        "of the Minigames that unlock after Enchanting 20."
      ]
    },
    "Shh...": {
      "difficulty": "Easy",
      "note": [
        "100 Secrets in Dungeons"
      ],
      "guide": [
        "This will need Combat 15 to enter any Dungeon.",
        "Almost all Dungeon Rooms have a couple secrets,",
        "some of the may require Ender Pearls to reach.",
        "The Secret Tracker 3000 from Malik can help",
        "if you have trouble finding secrets."
      ]
    },
    "Collector": {
      "difficulty": "Medium",
      "note": [
        "50 Collections to t2+"
      ],
      "guide": [
        "You can easily get t2 in the following:",
        "  17x Farming, 16x Mining,",
        "  7x Combat and 12x Foraging"
      ]
    },
    "Bedazzled": {
      "difficulty": "Medium",
      "note": [
        "30 unique Accessories"
      ],
      "guide": [
        "List of more than 30 talismans:",
        "  Buy all 6 Talismans from the Adventurer in The Hub (26k)",
        "Collection Talismans:",
        "  Farming Talisman, Vaccine Talisman,",
        "  Gravity Talisman, Talisman of Coins, Magnetic Talisman,",
        "  Wood Affinity Talisman, Speed Talisman, Potion Affinity Talisman,",
        "  Small Fish Bowl, Pressure Talisman, Talisman of Power,",
        "  Haste Ring, Emerald Ring",
        "Others:",
        "  Archaeologists Compass, Shiny Yellow Rock, King Talisman,",
        "  Campfire Initiate Badge, Cat Talisman, Spider Talisman,",
        "  Soul Campfire Initiate Badge, Runeblade Talisman,",
        "  Moonglade Talisman, New Year Cake Bag, Candy Talisman,",
        "  Pig's Foot, Wolf Paw, Pesthunter Talisman",
        "Don't forget to take the 4 Bonus accessory bag slots from",
        "the Redstone Miner, he needs 1920 Redstone in total."
      ]
    },
    "Lighter than steel": {
      "difficulty": "Easy",
      "note": [
        "4/4 Mithril Equipment"
      ],
      "guide": [
        "This will need Heart of the Mountain Tier 2",
        "and 12 Enchanted Mithril to forge all 4 pieces.",
        "Each piece has only a forge time of an hour."
      ]
    },
    "Oh Captain, My Captain": {
      "difficulty": "Medium",
      "note": [
        "2x Bronze Ship Parts"
      ],
      "guide": [
        "For this you'll need to fish in the Backwater Bayou.",
        "Recommended to go for is:",
        "  Bronze Ship Helm: 64 Dark Oak Wood + 4 Bronze Bowl",
        "    (Bronze Bowl is a 1/23 drop from Dumpster Divers)",
        "  Bronze Engine: 64 Rusty Coins + 8 Busted Belt Buckles",
        "    (You'll need Junker Joels Junk Sinker for this and",
        "    he's also the one that's selling the part.)"
      ]
    },
    "Legal Duplication": {
      "difficulty": "Easy",
      "note": [
        "270 Mining Fortune"
      ],
      "guide": [
        "There's a couple ways to achieve this:",
        "  Mining Level (4 each), Fortune 3+ Enchant (45),",
        "  Mithril Equipment (25), Mining Tool Base Stat (2+),",
        "  Century Cake (5 from /visit skyerzz),",
        "  Mining Fortune HotM2 Perk (2/tier),",
        "  Better Together Dwarven Event (50, if 1+ person near),",
        "  Goblin/Lapis Armor (8/16)"
      ]
    },
    "Forgery": {
      "difficulty": "Hard",
      "note": [
        "Forge a Drill"
      ],
      "guide": [
        "You'll want to forge a Ruby Drill TX-15 (HotM4),",
        "which needs 6 Fine Ruby Gems, a Fuel Canister (10h Forge Time)",
        "and a Drill Motor (44h total Forge time). Once you gathered",
        "all the materials, it needs 4h Forge Time."
      ]
    },
    "Fisherman's Folly": {
      "difficulty": "Hard",
      "note": [
        "OUTSTANDING treasure/junk catch"
      ],
      "guide": [
        "Recommended for this is any rod with the best",
        "Fishing Speed you can get and Blessing 5+ Enchant.",
        "If you want, you can further boost your chances",
        "by using a Rare+ Hermit Crab Pet.",
        "You might also want to do this in the Tomb Floodway",
        "on Galatea as you won't catch Sea Creatures there.",
        "If you fish in the Backwater Bayou, use the Junk Sinker",
        "from Joel as it awards Treasure Chance. You can go even",
        "further and buy a Junk Talisman or better from Joel",
        "in case you have those resources as spare."
      ]
    },
    "Chocolatier": {
      "difficulty": "Easy",
      "note": [
        "25m Chocolate"
      ],
      "guide": [
        "Open the Chocolate Factory Menu with /cf,",
        "get your first 50 Chocolate by clicking the button",
        "in the middle of it and buy your first Level of",
        "Rabbit Bro. Remember to check in every once in a while",
        "and upgrade your workers. You can also grab",
        "Chocolate Meal Eggs that spawn while Hoppity's Hunt is",
        "around to further speed this up."
      ]
    },
    "At your service": {
      "difficulty": "Medium",
      "note": [
        "50 completed Garden Visitor offers"
      ],
      "guide": [
        "Easy Visitors to go for are Jotraeline Greatforge",
        "and Gold Forger as they don't ask for much each visit.",
        "Other good choices to go for is the Librarian and any",
        "visitor that wants Wheat like Jacob does.",
        "(check the Wiki for more insight) Those can queue up to",
        "5 visitors total at a time without you",
        "needing to be online."
      ]
    },
    "Who needs friends?": {
      "difficulty": "Hard",
      "note": [
        "Solo a f1 with 270+ Score"
      ],
      "guide": [
        "This will heavily rely on your gear and Catacombs Level.",
        "Ideally you'll want to buy the best tier of Goggles from",
        "Ophelia that you can. Use End Armor for the remaining 3 pieces",
        "but replace them with better Dungeon Armor drops.",
        "Reforge your Armor to Wise or Necrotic if you can",
        "and your Dreadlord Sword to Heroic. Star your Dungeon Gear.",
        "You should also use the Power Stone that grants the most",
        "Intelligence that you have access to.",
        "§cDon't forget to use your Class Abilities!"
      ]
    },
    "Bayou Bobbin'": {
      "difficulty": "Medium",
      "note": [
        "4/4 Backwater Armor"
      ],
      "guide": [
        "For this you'll need to fish in the Backwater Bayou.",
        "This requires Angler Armor (bought in The Hub) and",
        "48 Rusty Coins (Junk catch that requires the Junk Sinker",
        "from Joel to be applied to your rod)"
      ]
    },
    "They're Prrrrrretty good": {
      "difficulty": "Medium",
      "note": [
        "Consume 4 Dwarven Cereals"
      ],
      "guide": [
        "Those have a 20% chance to drop if you participate",
        "in Active Dwarven Mines Events such as Goblin Raid,",
        "Raffle or Mithril Gourmand.",
        "The chance goes up to 36% if you get the personal bonus."
      ]
    }
  }
}
